{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"recurrent_dropout": 0.0, "bias_regularizer": null, "return_state": false, "activity_regularizer": null, "recurrent_regularizer": null, "bias_constraint": null, "activation": "tanh", "use_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "batch_input_shape": [null, 1, 1], "implementation": 1, "stateful": false, "kernel_regularizer": null, "name": "lstm_1", "trainable": true, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 10, "dtype": "float32", "unroll": false, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 1, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "2.2.3", "class_name": "Sequential"}